FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX700_RX72N_EnvisionKit_GCC_e2studio/src/smc_gen/r_gpio_rx/src/r_gpio_rx.c
    /* Write to the selected bit. & or | based on direction. */
    if( GPIO_DIRECTION_INPUT == dir )
    {
        /* Casting port address to uint8_t type
         * and set value to port address */
        *pdr = ( uint8_t ) ( ( *pdr ) & ( ~( 1 << ( pin & 0x00FFu ) ) ) );
    }
    else
    {
        /* Casting port address to uint8_t type
         * and set value to port address */
        *pdr = ( uint8_t ) ( ( *pdr ) | ( 1 << ( pin & 0x00FFu ) ) );
    }
} /* End of function R_GPIO_PinDirectionSet */

/***********************************************************************************************************************
 * Function Name: R_GPIO_PinControl
 ********************************************************************************************************************//**
 * @brief This function allows the user to control various settings of a pin.
 * @param[in] pin -Which pin to use. See Section 2.10.2, Pins
 * @param[in] cmd - Which command to execute for this pin. See Section 2.10.6, Control Commands for available commands.
 * @retval [GPIO_SUCCESS]            Successful; pin modified as specified by command.
 * @retval [GPIO_ERR_INVALID_MODE]   Error; this pin does not support the specified option.
 * @retval [GPIO_ERR_INVALID_CMD]    Error; the input command is not supported.
 * @details Depending on the MCU, pins have various settings that can be configured other than the direction and
 * output level. Some examples include enabling open-drain outputs, internal pull-ups, and changing drive capacity
 * levels. These features vary per chip which means that the options for this function will also vary.
 */
gpio_err_t R_GPIO_PinControl( gpio_port_pin_t pin,
                              gpio_cmd_t cmd )
{
    gpio_err_t err;
    uint8_t volatile * addr;
    uint8_t pin_number;

    #if ( GPIO_CFG_PARAM_CHECKING_ENABLE == 1 )
        uint8_t port_number;

        /* Get port number */
        port_number = ( uint8_t ) ( pin >> 8 );
    #endif

    err = GPIO_SUCCESS;

    /* Get pin number */
    pin_number = ( uint8_t ) ( pin & 0x00FFu );

    switch( cmd )
    {
        #if defined( GPIO_DSCR_IS_SUPPORTED )
            case GPIO_CMD_DSCR_ENABLE:
                #if ( GPIO_CFG_PARAM_CHECKING_ENABLE == 1 )
                if( false == gpio_pin_function_check( &g_gpio_dscr_support[ 0 ], port_number, pin_number ) )
                {
                    err = GPIO_ERR_INVALID_MODE;
                    break;
                }
                #endif
                /* Get pin's address */
                addr = gpio_port_addr_get( GPIO_PRV_BASE_ADDR_DSCR, ( uint16_t ) pin );

                /* Get value at pin's address */
                *addr = ( uint8_t ) ( ( *addr ) | ( 1 << pin_number ) );
                break;

            case GPIO_CMD_DSCR_DISABLE:
                #if ( GPIO_CFG_PARAM_CHECKING_ENABLE == 1 )
                if( false == gpio_pin_function_check( &g_gpio_dscr_support[ 0 ], port_number, pin_number ) )
                {
                    err = GPIO_ERR_INVALID_MODE;
                    break;
                }
                #endif
                /* Get pin's address */
                addr = gpio_port_addr_get( GPIO_PRV_BASE_ADDR_DSCR, ( uint16_t ) pin );

                /* Get value at pin's address */
                *addr = ( uint8_t ) ( ( *addr ) & ( ~( 1 << pin_number ) ) );
                break;
        #endif /* GPIO_DSCR_IS_SUPPORTED */
        #if defined( GPIO_DSCR2_IS_SUPPORTED )
            case GPIO_CMD_DSCR2_ENABLE:
                #if ( GPIO_CFG_PARAM_CHECKING_ENABLE == 1 )
                if( false == gpio_pin_function_check( &g_gpio_dscr2_support[ 0 ], port_number, pin_number ) )
                {
                    err = GPIO_ERR_INVALID_MODE;
                    break;
                }
                #endif
                /* Get pin's address */
                addr = gpio_port_addr_get( GPIO_PRV_BASE_ADDR_DSCR2, ( uint16_t ) pin );

                /* Set value to pin */
                *addr = ( uint8_t ) ( ( *addr ) | ( 1 << pin_number ) );
                break;

            case GPIO_CMD_DSCR2_DISABLE:
                #if ( GPIO_CFG_PARAM_CHECKING_ENABLE == 1 )
                if( false == gpio_pin_function_check( &g_gpio_dscr2_support[ 0 ], port_number, pin_number ) )
                {
                    err = GPIO_ERR_INVALID_MODE;
                    break;
                }
                #endif
                /* Get pin's address */
                addr = gpio_port_addr_get( GPIO_PRV_BASE_ADDR_DSCR2, ( uint16_t ) pin );

                /* Set value to pin */
                *addr = ( uint8_t ) ( ( *addr ) & ( ~( 1 << pin_number ) ) );
                break;
        #endif /* GPIO_DSCR2_IS_SUPPORTED */
        case GPIO_CMD_ASSIGN_TO_GPIO:
            /* Get pin's address */
            addr = gpio_port_addr_get( GPIO_PRV_BASE_ADDR_MODE, ( uint16_t ) pin );

            /* Set value to pin */
            *addr = ( uint8_t ) ( ( *addr ) & ( ~( 1 << pin_number ) ) );
            break;

        case GPIO_CMD_ASSIGN_TO_PERIPHERAL:
            /* Get pin's address */
            addr = gpio_port_addr_get( GPIO_PRV_BASE_ADDR_MODE, ( uint16_t ) pin );

            /* Set value to pin */
            *addr = ( uint8_t ) ( ( *addr ) | ( 1 << pin_number ) );
            break;

        case GPIO_CMD_IN_PULL_UP_DISABLE:
            #if ( GPIO_CFG_PARAM_CHECKING_ENABLE == 1 )
            if( false == gpio_pin_function_check( &g_gpio_pull_up_support[ 0 ], port_number, pin_number ) )
            {
                err = GPIO_ERR_INVALID_MODE;
                break;
            }
            #endif
            /* Get pin's address */
            addr = gpio_port_addr_get( GPIO_PRV_BASE_ADDR_PULL_UP, ( uint16_t ) pin );

            /* Set value to pin */
            *addr = ( uint8_t ) ( ( *addr ) & ( ~( 1 << pin_number ) ) );
            break;

        case GPIO_CMD_IN_PULL_UP_ENABLE:
            #if ( GPIO_CFG_PARAM_CHECKING_ENABLE == 1 )
            if( false == gpio_pin_function_check( &g_gpio_pull_up_support[ 0 ], port_number, pin_number ) )
            {
                err = GPIO_ERR_INVALID_MODE;
                break;
            }
            #endif
            /* Get pin's address */
            addr = gpio_port_addr_get( GPIO_PRV_BASE_ADDR_PULL_UP, ( uint16_t ) pin );

            /* Set value to pin */
            *addr = ( uint8_t ) ( ( *addr ) | ( 1 << pin_number ) );
            break;

        case GPIO_CMD_OUT_CMOS:
            gpio_set_output_type( pin, GPIO_PIN_OUT_CMOS );

            break;

