FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX700_RX72N_EnvisionKit_GCC_e2studio/src/smc_gen/r_gpio_rx/src/r_gpio_rx.c
        case GPIO_CMD_OUT_OPEN_DRAIN_N_CHAN:
            #if ( GPIO_CFG_PARAM_CHECKING_ENABLE == 1 )
            if( false == gpio_pin_function_check( &g_gpio_open_drain_n_support[ 0 ], port_number, pin_number ) )
            {
                err = GPIO_ERR_INVALID_MODE;
                break;
            }
            #endif

            gpio_set_output_type( pin, GPIO_PIN_OUT_OPEN_DRAIN_N_CHAN );

            break;

        case GPIO_CMD_OUT_OPEN_DRAIN_P_CHAN:
            #if ( GPIO_CFG_PARAM_CHECKING_ENABLE == 1 )
            if( false == gpio_pin_function_check( &g_gpio_open_drain_p_support[ 0 ], port_number, pin_number ) )
            {
                err = GPIO_ERR_INVALID_MODE;
                break;
            }
            #endif
            gpio_set_output_type( pin, GPIO_PIN_OUT_OPEN_DRAIN_P_CHAN );

            break;

        default:
            err = GPIO_ERR_INVALID_CMD;
            break;
    }

    return err;
} /* End of function R_GPIO_PinControl */

/***********************************************************************************************************************
 * Function Name: R_GPIO_GetVersion
 ********************************************************************************************************************//**
 * @brief Returns the current version of this API.
 * @return  Version of this API.
 * @details This function will return the version of the currently running API. The version number is encoded where
 * the top 2 bytes are the major version number and the bottom 2 bytes are the minor version number. For example,
 * Version 4.25 would be returned as 0x00040019.
 */
uint32_t R_GPIO_GetVersion( void )
{
    /* These version macros are defined in r_gpio_rx_if.h. */
    return( ( ( ( uint32_t ) GPIO_RX_VERSION_MAJOR ) << 16 ) | ( uint32_t ) GPIO_RX_VERSION_MINOR );
} /* End of function R_GPIO_GetVersion */

/***********************************************************************************************************************
* Function Name: gpio_port_addr_get
* Description  : Get the address for a port register based on a base port register address.
* Arguments    : base_addr -
*                    First port register of this type (e.g. &PORT0.PODR.BYTE)
*                index -
*                    Index off the base. (e.g. for PORT4 it would be 0x0400)
* Return Value : Address of the register that was requested
***********************************************************************************************************************/

R_BSP_PRAGMA_INLINE( gpio_port_addr_get )
uint8_t volatile * gpio_port_addr_get( uint8_t volatile * base_addr, uint16_t index )
{
    /* Add port number to 'index' to correct register. */
    return ( uint8_t volatile * ) ( ( ( ( uint32_t ) index >> 8 ) & 0x000000FFuL ) + ( uint32_t ) base_addr );
} /* End of function gpio_port_addr_get */

#if ( GPIO_CFG_PARAM_CHECKING_ENABLE == 1 )

/***********************************************************************************************************************
* Function Name: gpio_pin_function_check
* Description  : Checks to see if a pin supports a certain function.
* Arguments    : check_array -
*                    Which support array to use.
*                port_number -
*                    Which port to use.
*                pin_number -
*                    Which pin to use.
* Return Value : true -
*                    Functionality is supported on this pin.
*                false -
*                    Functionality is not supported on this pin.
***********************************************************************************************************************/
    R_BSP_PRAGMA_INLINE( gpio_pin_function_check )
    bool gpio_pin_function_check( uint8_t const * check_array,
                                  uint8_t port_number,
                                  uint8_t pin_number )
    {
        if( ( check_array[ port_number ] & ( 1 << pin_number ) ) != 0 )
        {
            return true;
        }
        else
        {
            return false;
        }
    } /* End of function gpio_pin_function_check */
#endif /* if ( GPIO_CFG_PARAM_CHECKING_ENABLE == 1 ) */

/***********************************************************************************************************************
* Function Name: gpio_set_output_type
* Description  : Configures pin output type (e.g. CMOS, open-drain)
* Arguments    : pin -
*                    Which pin to change output type for
*                out_type -
*                    What output type to use for this pin
* Return Value : None
***********************************************************************************************************************/
void gpio_set_output_type( gpio_port_pin_t pin,
                           gpio_pin_output_t out_type )
{
    uint8_t volatile * addr;
    uint8_t pin_number;
    uint8_t bit_offset;

    /* Get pin number */
    pin_number = ( uint8_t ) ( pin & 0x00FFu );

    /* 'pin' is multiplied by 2 because the ODR0 and ODR1 registers are staggered. This means that PORT0.ODR0
     * and PORT1.ODR0 are separated by 2 bytes instead of 1 as with the other port registers. */
    addr = gpio_port_addr_get( GPIO_PRV_BASE_ADDR_OUT_TYPE, ( uint16_t ) ( ( ( uint16_t ) pin ) * 2 ) );

    /* ODR bit fields are 2-bits a piece. This means bits 0-3 are in the 1st byte (ODR0) and bits 4-7 are in
     * the 2nd byte (ODR1).
     */
    if( pin_number > 3 )
    {
        /* Bit field is in ODR1. Increment address by 1 for ODR1 register for this port. */
        addr += 1;

        /* Subtract 4 from pin number since pins 4-7 are stored in ODR1 which is an 8-bit register.
         * Multiple pin number by 2 since each pin is represented by 2 bits.
         */
        bit_offset = ( uint8_t ) ( ( pin_number - 4 ) * 2 );
    }
    else
    {
        /* Multiple pin number by 2 since each pin is represented by 2 bits. */
        bit_offset = ( uint8_t ) ( pin_number * 2 );
    }

    /* Clear the bits we intend to change. */
    *addr = ( uint8_t ) ( ( *addr ) & ( ~( 3 << bit_offset ) ) );

    /* Set the bits again if needed. */
    *addr = ( uint8_t ) ( ( *addr ) | ( ( ( uint8_t ) out_type ) << bit_offset ) );
} /* End of function gpio_set_output_type */
